Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresVariables.Add Method
 Adds a variable to the list.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void Add(
	string key
)
Public Shared Sub Add (
	key As String
)
Parameters
key
Type: System.String
The variable to be added.
See Also
Reference
TeklaStructuresVariables Class
Tekla.Structures Namespace